===============================================================================
Description (Empty)
===============================================================================

%description

-------------------------------------------------------------------------------

(spec
  (description))

===============================================================================
Description (One-Line)
===============================================================================

%description
Simple description

-------------------------------------------------------------------------------

(spec
  (description
    (text
      (text_content))))

===============================================================================
Description (subpackage)
===============================================================================

%description subpackage
Simple description

-------------------------------------------------------------------------------

(spec
  (description
    (single_word
      (string_content))
    (text
      (text_content))))

===============================================================================
Description (subpackage with macros)
===============================================================================

%description subpackage
The %{name}-subpackage package

-------------------------------------------------------------------------------

(spec
  (description
    (single_word
      (string_content))
    (text
      (text_content)
      (macro_expansion
        (variable_name))
      (text_content))))

===============================================================================
Description (subpackage with arbitrary name)
===============================================================================

%description -n subpackage
Simple description

-------------------------------------------------------------------------------

(spec
  (description
    (single_word
      (string_content))
    (text
      (text_content))))

===============================================================================
Description (subpackage with macro-including name)
===============================================================================

%description -n %{name}-foo
Simple description

-------------------------------------------------------------------------------

(spec
  (description
    (single_word
      (macro_expansion
        (variable_name))
      (string_content))
    (text
      (text_content))))
